{
    "locales": {
        "en": {
            "title": "<span class='text-primary'>Projects</span>",
            "description": "These are some of the recent projects I have participated in."
        },
        "es": {
            "title": "Mi <span class='text-primary'>Portafolio</span>",
            "description": "Explora una selección de mis proyectos recientes y trabajos creativos."
        },
        "fr": {
            "title": "Mon <span class='text-primary'>Portfolio</span>",
            "description": "Découvrez une sélection de mes projets récents et œuvres créatives."
        },
        "zh": {
            "title": "我的<span class='text-primary'>作品集</span>",
            "description": "浏览我最近的一些项目和创意作品。"
        }
    },

    "subcategories": [
        {
            "id": "research",
            "locales": {
                "en": {"title": "Research"},
                "es": {"title": "Productividad"},
                "fr": {"title": "Productivité"},
                "zh": {"title": "生产力"}
            }
        }
    ],

    "items": {
        "research": [
            {
                "id": "besser",
                "title": "BESSER",
                "logoUrl": "images/portfolio/besser.png",
                "links": [
                    {"faIcon": "fa-brands fa-github", "href": "https://github.com/BESSER-PEARL/BESSER", "id": "GitHub"},
                    {"faIcon": "fa fa-book", "href": "https://besser.readthedocs.io/en/latest/index.html", "id": "ReadTheDocs"}
                ],
                "locales": {
                    "en": {
                        "description": "<b>BESSER</b> is an open source low-code platform built on top of our Python-based personal interpretation of a “Universal Modeling Language” (yes, heavily inspired and a simplified version of the better known UML, the Unified Modeling Language).",
                        "tags": ["low-code", "MDE", "code generation", "no-code", "research"]
                    },
                    "es": {
                        "description": "<b>BrainPulse</b> es tu aplicación definitiva de productividad, que te ayuda a gestionar tareas, organizar tu horario y aumentar tu concentración. Con su interfaz elegante y moderna, BrainPulse ofrece funciones como listas de tareas, recordatorios, seguimiento de objetivos y métricas de productividad personalizables. Ya seas un estudiante, un profesional o cualquier persona que busque optimizar su tiempo y eficiencia, BrainPulse es tu aplicación indispensable para lograr más sin sacrificar el equilibrio entre el trabajo y la vida personal.",
                        "tags": ["aplicación", "productividad", "tareas", "concentración"]
                    },
                    "fr": {
                        "description": "<b>BrainPulse</b> est votre application ultime de productivité, vous aidant à gérer les tâches, organiser votre emploi du temps et améliorer votre concentration. Avec son interface élégante et moderne, BrainPulse propose des fonctionnalités telles que des listes de tâches, des rappels, un suivi des objectifs et des mesures de productivité personnalisables. Que vous soyez étudiant, professionnel ou toute personne cherchant à optimiser son temps et son efficacité, BrainPulse est votre application incontournable pour en faire plus tout en maintenant un équilibre entre travail et vie personnelle.",
                        "tags": ["application", "productivité", "tâches", "concentration"]
                    },
                    "zh": {
                        "description": "<b>BrainPulse</b> 是您的终极生产力应用，可帮助您管理任务，组织日程并增强专注力。凭借其时尚现代的界面，BrainPulse 提供任务列表、提醒、目标跟踪和可定制的生产力指标等功能。无论您是学生、专业人士还是任何希望优化时间和效率的人，BrainPulse 都是您不可或缺的应用程序，助您在保持工作与生活平衡的同时实现更多成就。",
                        "tags": ["应用", "生产力", "任务", "专注力"]
                    }
                }
            },

            {
                "id": "transact",
                "title": "TRANSACT",
                "logoUrl": "images/portfolio/transact.png",
                "links": [
                    {"faIcon": "fa fa-globe", "href": "https://transact-ecsel.eu/", "id": "Web"},
                    {"faIcon": "fa-brands fa-linkedin", "href": "https://www.linkedin.com/company/transact-project/", "id": "Linkedin"}
                ],
                "locales": {
                    "en": {
                        "description": "The overarching goal of the <b>TRANSACT</b> project is to develop a universal, distributed solution architecture for the transformation of safety-critical cyber-physical systems, from localised standalone systems into safe and secure distributed solutions leveraging edge and cloud computing.",
                        "tags": ["CPS", "MDE", "IoT", "research"]
                    },
                    "es": {
                        "description": "<b>Stackers</b> es tu aplicación todo en uno para la organización y la toma de notas, diseñada para optimizar tu vida digital. Con su integración perfecta de gestión de tareas, organización de notas y almacenamiento en la nube, Stackers te ayuda a mantener la organización y la productividad. Crea listas de tareas, apunta ideas y sincroniza tus notas en todos tus dispositivos sin esfuerzo. Ya seas estudiante, profesional o cualquier persona que busque un espacio de trabajo digital sin desorden, Stackers está aquí para elevar tu juego organizativo.",
                        "tags": ["aplicación", "organización", "notas", "productividad"]
                    },
                    "fr": {
                        "description": "<b>Stackers</b> est votre application tout-en-un pour l'organisation et la prise de notes, conçue pour simplifier votre vie numérique. Grâce à son intégration transparente de la gestion des tâches, de l'organisation des notes et du stockage cloud, Stackers vous aide à rester organisé et productif. Créez des listes de tâches, notez vos idées et synchronisez vos notes sur tous vos appareils en toute simplicité. Que vous soyez étudiant, professionnel ou toute personne recherchant un espace de travail numérique sans encombrement, Stackers est là pour élever votre niveau d'organisation.",
                        "tags": ["application", "organisation", "notes", "productivité"]
                    },
                    "zh": {
                        "description": "<b>Stackers</b> 是您的一体化组织和记事应用，旨在优化您的数字生活。通过无缝集成的任务管理、记事组织和云存储功能，Stackers 帮助您保持组织和高效。创建待办事项列表，记录想法，并轻松在各设备间同步您的笔记。无论您是学生、专业人士还是寻求无杂乱数字工作空间的任何人，Stackers 都在此，提升您的组织能力。",
                        "tags": ["应用", "组织", "笔记", "生产力"]
                    }
                }
            }
        ]
    }
}